/******************************************************************************

          版权所有 (C), 2011-2012, 信意电子科技(http://xydz123.taobao.com/)

 ******************************************************************************
  文 件 名   : main.c
  版 本 号   : v1.0
  作    者   : Guokaiyi
  生成日期   : 2012-11-10
  最近修改   : 
  功能描述   : OV5116CCD驱动并在OLED上显示图像例程
               说明: 
               ----------------------------------------------------------------
               OV5116CCD接线
               黑线 G   电源地
               红线 VCC 12V (电压一定要稳定纹波要小)
               黄线 AO  CCD模拟信号输出经过硬件二值化后接到PORTK_PK0
               ----------------------------------------------------------------     
               OLED屏接线
               G    电源地
               VCC  接5V或3.3v电源
               D0   PORTA_PA0 宏为 LED_SCL
               D1   PORTA_PA1 宏为 LED_SDA
               RST  PORTA_PA2 宏为 LED_RST
               DC   PORTA_PA3 宏为 LED_DC 
               CS   已接地，不用接
               ----------------------------------------------------------------
               注意:如您的接口与本例程不一样，修改时请不要遗漏了各模块初始化部分
                    中对管脚输入/输出的配置
               ----------------------------------------------------------------
  修改历史   :
  1.日    期   : 2012-11-10
    作    者   : Guokaiyi
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------------------------------------*
 * 包含头文件                                                                 *
 *----------------------------------------------------------------------------*/
#include "common.h"
#include "system_funtion.h"
#include "oled.h"
#include "ov5116.h"

/*----------------------------------------------------------------------------*
 * 宏定义                                                                     *
 *----------------------------------------------------------------------------*/
#define MAIN_OLED_ROW     60 
#define MAIN_OLED_COLUMN 128

/*----------------------------------------------------------------------------*
 * 全局变量                                                                   *
 *----------------------------------------------------------------------------*/
//此部分内存很大，使用时请按需要调整
UCHAR8 g_aucImageTable[MAIN_OLED_ROW][MAIN_OLED_COLUMN]; //用于在OLED屏上显示的图片缓存

/*----------------------------------------------------------------------------*
 * 内部函数原型                                                               *
 *----------------------------------------------------------------------------*/
VOID MAIN_Init(VOID);

/*----------------------------------------------------------------------------*
 * 外部函数原型                                                               *
 *----------------------------------------------------------------------------*/

VOID main(void) 
{    
    MAIN_Init(); //初始化

    for(;;)
    {
        CCD_GetImage((UCHAR8 *)g_aucImageTable,  MAIN_OLED_ROW, MAIN_OLED_COLUMN, 1);
        LED_PrintImage((UCHAR8*)g_aucImageTable, MAIN_OLED_ROW, MAIN_OLED_COLUMN); //在OLED上显示图像波形图
    }
    
    return;
}

/*****************************************************************************
 函 数 名  : MAIN_Init
 功能描述  : 初始化所有模块
 输入参数  : NONE  
 输出参数  : NONE
 返 回 值  : NONE
*****************************************************************************/
VOID MAIN_Init(VOID)
{
    SYSTEM_PLL_Init();
    LED_Init();
    CCD_Init();

    return;
}
