/******************************************************************************

          版权所有 (C), 2011-2012, 信意电子科技(http://xydz123.taobao.com/)

 ******************************************************************************
  文 件 名   : ov5116.h
  版 本 号   : v1.0
  作    者   : Guokaiyi
  生成日期   : 2012-11-20
  最近修改   : 
  功能描述   : 

  修改历史   :
  1.日    期   : 2012-11-20
    作    者   : Guokaiyi
    修改内容   : 创建文件

******************************************************************************/
#ifndef __OV5116_H__
#define __OV5116_H__

/*----------------------------------------------------------------------------*
 * 包含头文件                                                                 *
 *----------------------------------------------------------------------------*/
#include "common.h"

/*----------------------------------------------------------------------------*
 * 宏定义                                                                     *
 *----------------------------------------------------------------------------*/
#define CCD_ENABLE_ITRP_ROW()     PIEH = 0x01 //中断使能寄存器;
#define CCD_DISNABLE_ITRP_ROW()   PIEH = 0x00 //中断使能寄存器;
#define CCD_CLR_ITRP_ROW_FLAG()   PIFH = 0x01 //对PIFH写1来清除标志位;
#define CCD_ENABLE_ITRP_FIELD()   PIEJ = 0x01 //中断使能寄存器;
#define CCD_DISNABLE_ITRP_FIELD() PIEJ = 0x00 //中断使能寄存器;
#define CCD_CLR_ITRP_FIELD_FLAG() PIFJ = 0x01 //对PIFJ写1来清除标志位;

#define CCD_SIGNAL     PORTK_PK0   //图像输入管脚
#define CCD_SIGNAL_DIR DDRK_DDRK0  //图像输入管脚输入输出寄存器

/*----------------------------------------------------------------------------*
 * 全局变量                                                                   *
 *----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*
 * 内部函数原型                                                               *
 *----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*
 * 外部函数原型                                                               *
 *----------------------------------------------------------------------------*/
extern VOID CCD_Init(VOID);

extern VOID CCD_GetImage(UCHAR8 *pucImageTable, USHORT16 usRowNum, 
                         USHORT16 usColumnNum, USHORT16 usRowInterval);

#endif

