#include "include.h"  
/**********************************************************************   
*                             信意电子科技   
*                              OLED   
*  实验说明： OLED实验，利用 OLED 来显示电平高低   
*   
*  实验操作：无    
*   
*  实验效果：显示信意电子科技  
*    
*  修改时间：2012-11-14     测试   
*      
*  修改引脚口，请到OLED。h里进行引脚篡改
*************************************************************************/


 void  main(void)         
{   
    EnableInterrupts;
    LED_Init();
    LED_P14x16Str(20,1,"信意电子科技");
    LED_P6x8Str(1,6,"http://xydz123.taobao");
    LED_P6x8Str(50,7,".com");
    while(1);
    
}  